Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.Volume
The volume for this space.
Remarks:
If the space is created with the mode 'Use Rooms or Spaces', this value is the enclosed volume measured by interior bounding surfaces.
Otherwise, this value is the average of the analytical volume and the voxel volume. Note that the analytical volume is measured by
the center plane of walls and the top plane of roofs and floors,  and the voxel volume is measured by the number of enclosed unit cubes.
Since:
2023

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.Area
The area for this space.
Remarks:
If the space is created with the mode 'Use Rooms or Spaces', this value is the enclosed area measured by interior bounding surfaces.
Otherwise, this value is measured by the center plane of walls and the top plane of roofs and floors.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.ComposedName
The composed name for this space.
Remarks:
This value is composed of the number and name attributes,
separated by a space.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.Number
The number to identify the space.
Since:
2012